---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectError
source: html/5b743cdd-3049-e09f-aaf4-3a1d6f5c1745.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectError Property

The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project.
 Ensure the fitting is loaded in the project and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFittingInProjectError { get; }
```